# Day 12
---

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
sns.set()

In [4]:
titanic = sns.load_dataset('titanic')

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

[https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb](https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb)

In [9]:
titanic.groupby(['sex', 'class'])['survived'].describe()

sex     class
female  First   count     94.000000
                mean       0.968085
                std        0.176716
                min        0.000000
                25%        1.000000
                50%        1.000000
                75%        1.000000
                max        1.000000
        Second  count     76.000000
                mean       0.921053
                std        0.271448
                min        0.000000
                25%        1.000000
                50%        1.000000
                75%        1.000000
                max        1.000000
        Third   count    144.000000
                mean       0.500000
                std        0.501745
                min        0.000000
                25%        0.000000
                50%        0.500000
                75%        1.000000
                max        1.000000
male    First   count    122.000000
                mean       0.368852
                std        0.484484
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        1.000000
                max        1.000000
        Second  count    108.000000
                mean       0.157407
                std        0.365882
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        0.000000
                max        1.000000
        Third   count    347.000000
                mean       0.135447
                std        0.342694
                min        0.000000
                25%        0.000000
                50%        0.000000
                75%        0.000000
                max        1.000000
Name: survived, dtype: float64

In [10]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [11]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [13]:
pd.cut(titanic['age'], [0, 18, 80])

0      (18, 80]
1      (18, 80]
2      (18, 80]
3      (18, 80]
4      (18, 80]
5           NaN
6      (18, 80]
7       (0, 18]
8      (18, 80]
9       (0, 18]
10      (0, 18]
11     (18, 80]
12     (18, 80]
13     (18, 80]
14      (0, 18]
15     (18, 80]
16      (0, 18]
17          NaN
18     (18, 80]
19          NaN
20     (18, 80]
21     (18, 80]
22      (0, 18]
23     (18, 80]
24      (0, 18]
25     (18, 80]
26          NaN
27     (18, 80]
28          NaN
29          NaN
         ...
861    (18, 80]
862    (18, 80]
863         NaN
864    (18, 80]
865    (18, 80]
866    (18, 80]
867    (18, 80]
868         NaN
869     (0, 18]
870    (18, 80]
871    (18, 80]
872    (18, 80]
873    (18, 80]
874    (18, 80]
875     (0, 18]
876    (18, 80]
877    (18, 80]
878         NaN
879    (18, 80]
880    (18, 80]
881    (18, 80]
882    (18, 80]
883    (18, 80]
884    (18, 80]
885    (18, 80]
886    (18, 80]
887    (18, 80]
888         NaN
889    (18, 80]
890    (18, 80]
Name: age, dtype: category
Categories (2, object): [(0, 18] < (18, 80]]

In [16]:
titanic.pivot_table('survived', index=['sex', pd.cut(titanic['age'], [0, 18, 80])], 
                    columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [20]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [23]:
titanic.pivot_table('survived', index='sex', columns='class', margins=True, 
                    aggfunc='count')

class   First  Second  Third    All
sex
female   94.0    76.0  144.0  314.0
male    122.0   108.0  347.0  577.0
All     216.0   184.0  491.0  891.0

**Notice use of _margins_ and _aggfunc_, we can use other aggregation functions as _sum_, _min_, _max_ ..**

**_All_ can be replaced with _margin\_name_ argument as well**